---
kind: method
id: M:Autodesk.Revit.DB.Lighting.PresetInitialColor.#ctor(Autodesk.Revit.DB.Lighting.ColorPreset)
source: html/d4b30f41-1bd8-4b0d-dc06-78757fb0b094.htm
---
# Autodesk.Revit.DB.Lighting.PresetInitialColor.#ctor Method

Creates an initial color preset object with the given preset value.

## Syntax (C#)
```csharp
public PresetInitialColor(
	ColorPreset presetIn
)
```

## Parameters
- **presetIn** (`Autodesk.Revit.DB.Lighting.ColorPreset`) - The enum value which determines the preset value

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration